## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 17 to add, 2 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                  NAME                                                   |
|----------|---------------------------------------------------------------------------------------------------------|
| recreate | `module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]`  |
|          | `module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1]`  |
| add      | `aws_acm_certificate_validation.notification-canada-ca`                                                 |
|          | `aws_acm_certificate_validation.notification-canada-ca-alt`                                             |
|          | `aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs`                                  |
|          | `aws_route53_record.api-k8s-scratch-notification-sandbox-CNAME[0]`                                      |
|          | `aws_route53_record.api-weighted-0-scratch-notification-sandbox-A[0]`                                   |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.api.staging.notification.alpha.cdssandbox.xyz&quot;]`      |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.document.staging.notification.alpha.cdssandbox.xyz&quot;]` |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.staging.notification.alpha.cdssandbox.xyz&quot;]`          |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;api.staging.notification.alpha.cdssandbox.xyz&quot;]`        |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;staging.notification.alpha.cdssandbox.xyz&quot;]`            |
|          | `aws_route53_record.notification-canada-ca[&quot;*.api.staging.notification.cdssandbox.xyz&quot;]`                |
|          | `aws_route53_record.notification-canada-ca[&quot;*.document.staging.notification.cdssandbox.xyz&quot;]`           |
|          | `aws_route53_record.notification-canada-ca[&quot;*.staging.notification.cdssandbox.xyz&quot;]`                    |
|          | `aws_route53_record.notification-canada-ca[&quot;api.staging.notification.cdssandbox.xyz&quot;]`                  |
|          | `aws_route53_record.notification-canada-ca[&quot;staging.notification.cdssandbox.xyz&quot;]`                      |
| delete   | `aws_route53_record.notification-canada-ca-alt[0]`                                                      |
|          | `aws_route53_record.notification-canada-ca[0]`                                                          |
| update   | `aws_ec2_managed_prefix_list.google_cidrs`                                                              |
|          | `module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder`                                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate_validation.notification-canada-ca will be created
  + resource "aws_acm_certificate_validation" "notification-canada-ca" {
      + certificate_arn         = "arn:aws:acm:ca-central-1:239043911459:certificate/db0b2d43-d054-4c2f-b991-a946f665b445"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.notification-canada-ca-alt will be created
  + resource "aws_acm_certificate_validation" "notification-canada-ca-alt" {
      + certificate_arn         = "arn:aws:acm:ca-central-1:239043911459:certificate/317e3889-3b13-4c28-b360-7f5c7d54d2b8"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs will be created
  + resource "aws_cloudwatch_log_group" "notification-canada-ca-eks-application-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.admin_api_request has moved to aws_cloudwatch_log_subscription_filter.admin_api_request[0]
    resource "aws_cloudwatch_log_subscription_filter" "admin_api_request" {
        id              = "cwlsf-536729344"
        name            = "Admin API request"
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.blazer_logging has moved to aws_cloudwatch_log_subscription_filter.blazer_logging[0]
    resource "aws_cloudwatch_log_subscription_filter" "blazer_logging" {
        id              = "cwlsf-1214848348"
        name            = "Blazer logging"
        # (4 unchanged attributes hidden)
    }

  # aws_ec2_managed_prefix_list.google_cidrs will be updated in-place
  ~ resource "aws_ec2_managed_prefix_list" "google_cidrs" {
        id             = "pl-0b6237ea4ffab2184"
      ~ max_entries    = 100 -> 20
        name           = "Google Service CIDRs"
        tags           = {
            "CostCentre" = "notification-canada-ca-staging"
        }
        # (5 unchanged attributes hidden)

        # (72 unchanged blocks hidden)
    }

  # aws_route53_record.api-k8s-scratch-notification-sandbox-CNAME[0] will be created
  + resource "aws_route53_record" "api-k8s-scratch-notification-sandbox-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api-k8s.staging.notification.cdssandbox.xyz"
      + records         = [
          + "notification-staging-alb-1878361959.ca-central-1.elb.amazonaws.com",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.api-weighted-0-scratch-notification-sandbox-A[0] will be created
  + resource "aws_route53_record" "api-weighted-0-scratch-notification-sandbox-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.staging.notification.cdssandbox.xyz"
      + set_identifier  = "loadbalancer"
      + type            = "A"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = "notification-staging-alb-1878361959.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }

      + weighted_routing_policy {
          + weight = 0
        }
    }

  # aws_route53_record.notification-canada-ca[0] will be destroyed
  # (because resource does not use count)
  - resource "aws_route53_record" "notification-canada-ca" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_3bc5d092ce090455c7a5a18436fa7d65.mqzgcdqkwq.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca["*.api.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_3bc5d092ce090455c7a5a18436fa7d65.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["*.document.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_b4c1dfe3fa5ef9427b62475bf31154f3.document.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_aa51db2fea1aaaa2486be78695309fd4.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["*.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_a3c8bd5843dfed42acc803da5f589492.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["api.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_3bc5d092ce090455c7a5a18436fa7d65.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_a3c8bd5843dfed42acc803da5f589492.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt[0] will be destroyed
  # (because resource does not use count)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz" -> null
      - records                          = [
          - "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca-alt["*.api.staging.notification.alpha.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz"
      + records         = [
          + "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.document.staging.notification.alpha.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_0b470ab7b948ce2073da749061c99afa.document.staging.notification.alpha.cdssandbox.xyz"
      + records         = [
          + "_3b9faf7a03aadc824ded19cf529bf3dd.gbycpywhzv.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.staging.notification.alpha.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz"
      + records         = [
          + "_b64b3e23bcbf064b6575422707914bbd.gbycpywhzv.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["api.staging.notification.alpha.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz"
      + records         = [
          + "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["staging.notification.alpha.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz"
      + records         = [
          + "_b64b3e23bcbf064b6575422707914bbd.gbycpywhzv.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
      + code_signing_config_arn        = ""
      + filename                       = "/tmp/sentinel_forwarder.py.zip"
        id                             = "sentinel-cloud-watch-forwarder"
      + image_uri                      = ""
      + kms_key_arn                    = ""
      ~ last_modified                  = "2023-01-23T14:08:56.000+0000" -> (known after apply)
      + publish                        = false
      + signing_job_arn                = ""
      + signing_profile_version_arn    = ""
        tags                           = {
            "CostCentre" = "notification-canada-ca-staging"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "CUSTOMER_ID" = (sensitive)
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "SHARED_KEY"  = (sensitive)
                # (1 unchanged element hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] must be replaced
-/+ resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      ~ function_name       = "arn:aws:lambda:ca-central-1:239043911459:function:sentinel-cloud-watch-forwarder" -> "sentinel-cloud-watch-forwarder" # forces replacement
      ~ id                  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-0" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1] must be replaced
-/+ resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      ~ function_name       = "arn:aws:lambda:ca-central-1:239043911459:function:sentinel-cloud-watch-forwarder" -> "sentinel-cloud-watch-forwarder" # forces replacement
      ~ id                  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-1" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 17 to add, 2 to change, 4 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
